Nama : Riyan Dicky Satria

NIM  : 18.11.2110

                                           Pokok Bahasa 1 :
 1.2 Daftar Pertanyaan 
 
     1. Bagaimanakah bentuk koneksi database MongoDB pada Python?
         dengan menginstall driver MongoDB pada Python yang bernama PyMongo.
        - ini adalah cara installnya :
          pip install pymongo
        - dan menginport librarynya :
          import mongo
          
     2. Apakah dapat melakukan ekstraksi data dari database MongoDB menggunakan Python?                                  dapat,dengan melakukan ekstraksi data dari database MongoDB menggunakan Python dapat dilakukan dengan 
         bantuan library.
        - ini adalah cara installnya :
          pip install pandas

                                            Kompetensi 1 : 
D. Latihan 1

1. Koneksikan Python pada server mongoDB lokal dengan bentuk server public !

In [ ]:
pip install pymongo

In [34]:
import pymongo
from bson.json_util import dumps
client     = pymongo.MongoClient("mongodb://127.0.0.1:27017") #server
db         = client["coba2"] #database
collection = db["inventory"] #collection
query      = collection.find() #query
json_data  = dumps(list_query, indent=2)# setting pretty output
print(json_data)

[
  {
    "_id": {
      "$oid": "604834ccceb083ead15f82aa"
    },
    "item": "canvas",
    "qty": 100.0,
    "tags": [
      "cotton"
    ],
    "size": {
      "h": 28.0,
      "w": 35.5,
      "uom": "cm"
    }
  },
  {
    "_id": {
      "$oid": "604834f7ceb083ead15f82ab"
    },
    "item": "journal",
    "qty": 25.0,
    "tags": [
      "blank",
      "red"
    ],
    "size": {
      "h": 14.0,
      "w": 21.0,
      "uom": "cm"
    }
  },
  {
    "_id": {
      "$oid": "604834f7ceb083ead15f82ac"
    },
    "item": "mat",
    "qty": 85.0,
    "tags": [
      "gray"
    ],
    "size": {
      "h": 27.9,
      "w": 35.5,
      "uom": "cm"
    }
  },
  {
    "_id": {
      "$oid": "604834f7ceb083ead15f82ad"
    },
    "item": "mousepad",
    "qty": 25.0,
    "tags": [
      "gel",
      "blue"
    ],
    "size": {
      "h": 19.0,
      "w": 22.85,
      "uom": "cm"
    }
  }
]

2. Koneksikan Python pada server mongoDB lokal dengan bentuk server authorized !

In [39]:
from pymongo import MongoClient
client = MongoClient("mongodb://localhost:27017")
db = client.coba2
try: db.command("serverStatus")
except Exception as e: print(e)
else: print("Anda Terhubung")
client.close

Anda Terhubung

3. Daftarkan akun email student amikom ke cloud atlas mongoDB; buat cluster server dan koneksikan pada Python !

In [40]:
!pip install pymongo[srv]

Requirement already satisfied: pymongo[srv] in c:\users\user\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (3.11.4)
Requirement already satisfied: dnspython<2.0.0,>=1.16.0 in c:\users\user\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from pymongo[srv]) (1.16.0)

In [41]:
!pip install dnspython

Requirement already satisfied: dnspython in c:\users\user\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (1.16.0)

In [36]:
from pymongo import MongoClient
client = MongoClient(
    "mongodb+srv://slarkfall:dickysatria1234@newcluster.mn0mp.mongodb.net/test?authSource=admin&replicaSet=atlas-jt7rx5-shard-0&readPreference=primary&appname=MongoDB%20Compass&ssl=true")

In [37]:
db = client.coba
col =db.item

data1 = {"text" :"Modul_11","NIM": "18.11.2110", "Nama": "Riyan Dicky Satria"}

col.insert_one(data1)

In [38]:
results = col.find({})

for i in results:
    print(i)

{'_id': ObjectId('6086155237d5170cb02d6267'), 'text': 'haloo', 'Nama': 'Riyan Dicky Satria', 'NIM': '18.11.2110'}
{'_id': ObjectId('60e467283d2ed1f5007a36a9'), 'NIM': '18.11.2110', 'Nama': 'Riyan Dicky Satria'}
{'_id': ObjectId('60e467803d2ed1f5007a36aa'), 'text': 'Modul_11', 'NIM': '18.11.2110', 'Nama': 'Riyan Dicky Satria'}
{'_id': ObjectId('60e469683d2ed1f5007a36b0'), 'text': 'Modul_11', 'NIM': '18.11.2110', 'Nama': 'Riyan Dicky Satria'}

Kesimpulan : Keunggulan Pymongo dapat juga untuk menghubungkan python dengan MongoDB, dengan menginstall :
             pip install pymongo
             Untuk menggunakan pymongo sendiri kita perlu mengimport pymongo :
             import pymongo

                                            Pokok Bahasan 2 :

2.2 Daftar Pertanyaan 
    1. Apakah yang dimaksud data mining? 
        Data Mining adalah proses menemukan pola dan pengetahuan dengan menarik data dalam jumlah besar. 
        
    2. Bagaimanakah model data mining? 
       - Predictive Model, Mengumpulkan data untuk diolah hingga melahirkan pola informasi berupa nilai 
         prediksi. Yang termasuk model ini adalah Classification, Regression, Time-Series Analysis, dan 
         Prediction.
       - Descriptive Model, Mengumpulkan data untuk mempelajari bentuk hubungan atau pola dari sekumpulan data 
         yang ada. Yang termasuk model ini adalah Clustering, Summarization, Association Rules, dan Sequence 
         Discovery.
         
    3. Bagaimanakah tahapan data mining? 
       - Data Cleansing, Proses dimana data-data yang tidak lengkap, mengandung error dan tidak konsisten 
         dibuang dari koleksi data. 
       - Data Integration, Proses integrasi data dimana yang berulang akan dikombinasikan.
       - Selection, Proses seleksi atau pemilihan data yang relevan terhadap analisis untuk diterima dari 
         koleksi data yang ada.
       - Data Transformation, Proses transformasi data yang sudah dipilih ke dalam bentuk mining procedure 
         melalui cara dan agresi data.
       - Data Mining, Proses yang paling penting dimana akan dilakukan berbagai teknik yang diaplikasikan untuk 
         mengekstrak berbagai pola-pola potensial untuk mendapatkan data yang berguna.
       - Pattern Evolution,  Sebuah proses dimana pola-pola menarik yang sebelumnya sudah ditemukan dengan 
         identifikasi berdasarkan measure yang telah diberikan.
       - Knowledge Presentation, Merupakan proses tahap terakhir, Dalam hal ini digunakan teknik visualisasi 
         yang bertujuan membantu user dalam mengerti dan menginterpretasikan hasil dari penambangan data.

                                            Kompetensi 2 :

D. Latihan 2

1. Berikan contoh suatu nilai yang bersifat Incomplete, Noisy, Inconsistent, dan Duplicate !

In [43]:
inventory = {'_id':['1ab', '2cd', '3ef', '3ef','4gh','5ij','5ij'],
             'Nama_barang':['Sabun','Sampo','Odol','Odol','Parfum','GPU','GPU'], 
             'Harga':[3000, '2k',8000,8000,float("NaN"),12000, 12000]}
inventory

{'_id': ['1ab', '2cd', '3ef', '3ef', '4gh', '5ij', '5ij'],
 'Nama_barang': ['Sabun', 'Sampo', 'Odol', 'Odol', 'Parfum', 'GPU', 'GPU'],
 'Harga': [3000, '2k', 8000, 8000, nan, 12000, 12000]}

Output data inventory

In [44]:
import pandas as pds
import numpy as npy

inv = pds.DataFrame(inventory)
inv

   _id Nama_barang  Harga
0  1ab       Sabun   3000
1  2cd       Sampo     2k
2  3ef        Odol   8000
3  3ef        Odol   8000
4  4gh      Parfum    NaN
5  5ij         GPU  12000
6  5ij         GPU  12000

- Incomplete

In [45]:
inv.isna().sum()

_id            0
Nama_barang    0
Harga          1
dtype: int64

terlihat output diatas bahwa harga mempunyai 1 data incomplete

- Duplicate

In [46]:
inv.duplicated(subset=None, keep='first')

0    False
1    False
2    False
3     True
4    False
5    False
6     True
dtype: bool

output diatas adalah untuk mengecek data duplicate

2. Bagaimanakah cara untuk memperbaiki data missing? 
   dengan cara menghapus data yang kosong/NaN.

In [47]:
inv.dropna(inplace=True)
inv

   _id Nama_barang  Harga
0  1ab       Sabun   3000
1  2cd       Sampo     2k
2  3ef        Odol   8000
3  3ef        Odol   8000
5  5ij         GPU  12000
6  5ij         GPU  12000

output diatas adalah data baru dari penghapusan data yang kosong/NaN.

Kesimpulan : Data Cleansing, Proses dimana data-data yang tidak lengkap, mengandung error dan tidak konsisten 
             dibuang dari koleksi data.disini kita juga menggunakan library pandas dan numpy untuk melakukan data ekstraksi, 
             data framing dan pemrosesan data agar menjadi bersih tanpa adanya data yang incomplete, data yang duplicate, 
             data Inconsistent,data Noisy dan data yang Missing.

                                            Pokok Bahasan 3 :

3.2 Daftar Pertanyaan 
    1. Apakah fungsi library pandas pada data mining? 
       untuk melakukan manipulasi data,karena mempunyai struktur data yang fleksibel dan ekspresif.
    2. Bagaimanakah bentuk query library pandas pada data mining? 
     - Untuk import library
        import pandas as pd
       Untuk pembuatan data frame
        dataframe = pandas.DataFrame(data)
     - Untuk Import Data
        pd.read_csv(filename) #From a CSV file
        pd.read_table(filename) #From a delimited text file (like TSV)
        pd.read_excel(filename) #From an Excel file
        pd.read_sql(query, connection_object) # Read from a SQL table/database
        pd.read_json(json_string) # Read from a JSON formatted string, URL or file.
        pd.DataFrame(dict) # From a dict, keys for columns names, values for data as lists
     - Untuk Export Data
        pd.to_csv(filename) # Write to a CSV file
        pd.to_excel(filename) # Write to an Excel file
        pd.to_sql(table_name, connection_object) # Write to a SQL table
        pd.to_json(filename) # Write to a file in JSON format
     - Untuk Cleansing Data
        pd.isnull() # Checks for null Values, Returns Boolean Arrray
        pd.notnull() # Kebalikan dari pd.isnull()
        pd.dropna() # Drop all rows that contain null values
        pd.fillna(x) # Replace all null values with x
        pd.astype(float) # Convert the datatype of the series to float
        pd.replace(1,'one') # Replace all values equal to 1 with 'one’

                                                Kompetensi 3 : 
D. Latihan 3

In [67]:
import pymongo as pym
import pandas as pds
from bson.json_util import dumps
client = pym.MongoClient("mongodb://127.0.0.1:27017")
db = client["titanic"]
coll = db["passengers"]
cursor = coll.find()
result_cursor = list(cursor)
df = pds.DataFrame(result_cursor)
df

,_id,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Cabin
0,60d04ebfdb8077b4ebc9865f,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,S,NaN
1,60d04ebfdb8077b4ebc98660,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C,C85
2,60d04ebfdb8077b4ebc98661,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,S,NaN
3,60d04ebfdb8077b4ebc98662,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,S,C123
4,60d04ebfdb8077b4ebc98663,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,S,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,60d04ebfdb8077b4ebc989d5,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13,S,NaN
887,60d04ebfdb8077b4ebc989d6,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30,S,B42
888,60d04ebfdb8077b4ebc989d7,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,S,NaN
889,60d04ebfdb8077b4ebc989d8,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30,C,C148
890,60d04ebfdb8077b4ebc989d9,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,Q,NaN

1. Tampilkan statistik data per atribut untuk data yang kosong/null !

In [50]:
data_null = df.isnull().any(axis=1) 
df[data_null]

,_id,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Cabin
0,60d04ebfdb8077b4ebc9865f,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,S,NaN
2,60d04ebfdb8077b4ebc98661,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,S,NaN
4,60d04ebfdb8077b4ebc98663,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,S,NaN
5,60d04ebfdb8077b4ebc98664,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,Q,NaN
7,60d04ebfdb8077b4ebc98666,8,0,3,"Palsson, Master. Gosta Leonard",male,2,3,1,349909,21.075,S,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
884,60d04ebfdb8077b4ebc989d3,885,0,3,"Sutehall, Mr. Henry Jr",male,25,0,0,SOTON/OQ 392076,7.05,S,NaN
885,60d04ebfdb8077b4ebc989d4,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39,0,5,382652,29.125,Q,NaN
886,60d04ebfdb8077b4ebc989d5,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13,S,NaN
888,60d04ebfdb8077b4ebc989d7,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,S,NaN
890,60d04ebfdb8077b4ebc989d9,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,Q,NaN

2. Tampilkan statistik data per atribut untuk maksimal data !

In [56]:
df_atribut = df.astype('category')
df_atribut = df_atribut.astype('str')
df_atribut.max()

_id               60d04ebfdb8077b4ebc989d9
PassengerId                             99
Survived                                 1
Pclass                                   3
Name           van Melkebeke, Mr. Philemon
Sex                                   male
Age                                    nan
SibSp                                    8
Parch                                    6
Ticket                           WE/P 5735
Fare                                  93.5
Embarked                               nan
Cabin                                  nan
dtype: object

3. Tampilkan statistik data per atribut untuk minimal data !

In [58]:
df_atribut = df.astype('category')
df_atribut = df_atribut.astype('str')
df_atribut.min()

_id            60d04ebfdb8077b4ebc9865f
PassengerId                           1
Survived                              0
Pclass                                1
Name                Abbing, Mr. Anthony
Sex                              female
Age                                0.42
SibSp                                 0
Parch                                 0
Ticket                           110152
Fare                                  0
Embarked                              C
Cabin                               A10
dtype: object

4. Tampilkan umur maksimal pada dataset !

In [71]:
df_umur = df['Age'].astype('category')
df_umur = df_umur.astype("float")
df_umur.max()

80.0

5. Tampilkan umur minimal pada dataset !

In [65]:
df_umur = df['Age'].astype('category')
df_umur = df_umur.astype("float")
df_umur.min()

0.42

6. Tampilkan total data dengan umur diatas 18 tahun !

In [66]:
df_umur = df['Age'].astype('category')
df_umur = df_umur.astype("float")
df[df_umur>18]

,_id,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Cabin
0,60d04ebfdb8077b4ebc9865f,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,S,NaN
1,60d04ebfdb8077b4ebc98660,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C,C85
2,60d04ebfdb8077b4ebc98661,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,S,NaN
3,60d04ebfdb8077b4ebc98662,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,S,C123
4,60d04ebfdb8077b4ebc98663,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,S,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,60d04ebfdb8077b4ebc989d4,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39,0,5,382652,29.125,Q,NaN
886,60d04ebfdb8077b4ebc989d5,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13,S,NaN
887,60d04ebfdb8077b4ebc989d6,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30,S,B42
889,60d04ebfdb8077b4ebc989d8,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30,C,C148
890,60d04ebfdb8077b4ebc989d9,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,Q,NaN

Kesimpulan : Pandas adalah library python yang sangat sering digunakan.dapat digunakan untuk melakukan manipulasi  
             data,karena mempunyai struktur data yang fleksibel dan ekspresif.untuk menginstall nya pun cukup mudah dengan 
             cara pip install pandas